In [1]:
import pandas as pd
import numpy as np

In [20]:
# Part 1

In [2]:
df1 = pd.read_csv("data/users_with_age_data.csv")

In [3]:
df2 = pd.read_csv("data/users_with_gender_data.csv")

In [4]:
df1.merge(df2, on="user_id", how="left")

   user_id  age gender
0        1   30    'M'
1        2   40    'F'
2        4   14    'F'
3        6   35    'M'
4        7   16    NaN
5        8   50    NaN

In [7]:
users = df1.merge(df2, on="user_id", how="outer")

In [21]:
users['gender'] = users['gender'].fillna("'F'")

In [22]:
users['age'] = users['age'].fillna(users['age'].mean())

In [8]:
users

   user_id        age gender
0        1  30.000000    'M'
1        2  40.000000    'F'
2        4  14.000000    'F'
3        6  35.000000    'M'
4        7  16.000000    'F'
5        8  50.000000    'F'
6        3  30.833333    'M'
7        5  30.833333    'M'

In [14]:
grouped = users.groupby('gender')

In [15]:
grouped.count() # aggregation

        user_id  age
gender
'F'           4    4
'M'           4    4

In [16]:
grouped['age'].mean() # get mean age of each group

gender
'F'    30.000000
'M'    31.666667
Name: age, dtype: float64

In [17]:
users['minor'] = users['age'].apply(lambda x: True if x < 18 else False)

#def func(x):
#    if x < 18:
#        return True
#    return False
#
#users['minor'] = users['age'].apply(func)

In [18]:
users

   user_id        age gender  minor
0        1  30.000000    'M'  False
1        2  40.000000    'F'  False
2        4  14.000000    'F'   True
3        6  35.000000    'M'  False
4        7  16.000000    'F'   True
5        8  50.000000    'F'  False
6        3  30.833333    'M'  False
7        5  30.833333    'M'  False

In [19]:
# Part 2

In [23]:
users = pd.read_csv('movie/users.dat', delimiter='::', names=['user_id','gender','age','occupation_code','zip'], engine='python')

In [24]:
ratings = pd.read_csv('movie/ratings.dat', delimiter='::', names=['user_id','movie_id','rating','timestamp'], engine='python')

In [25]:
movies = pd.read_csv('movie/movies.dat', delimiter='::', names=['movie_id','title','genre'], engine='python')

In [30]:
# joins the all the files
merged = users.merge(ratings, on="user_id").merge(movies, on="movie_id")

In [31]:
sorted_movies = merged.groupby("title").count().sort_values(by='rating', ascending=False)

In [32]:
# displays 5 movies with most # of ratings
sorted_movies.head(5)

,user_id,gender,age,occupation_code,zip,movie_id,rating,timestamp,genre
title,,,,,,,,,
American Beauty (1999),3428,3428,3428,3428,3428,3428,3428,3428,3428
Star Wars: Episode IV - A New Hope (1977),2991,2991,2991,2991,2991,2991,2991,2991,2991
Star Wars: Episode V - The Empire Strikes Back (1980),2990,2990,2990,2990,2990,2990,2990,2990,2990
Star Wars: Episode VI - Return of the Jedi (1983),2883,2883,2883,2883,2883,2883,2883,2883,2883
Jurassic Park (1993),2672,2672,2672,2672,2672,2672,2672,2672,2672

In [37]:
# list moviess with >= 250 ratings
active_titles = sorted_movies.query('rating >= 250')
# Alternatively:
# active_titles = top_movies[top_movies['rating'] >= 250]

In [54]:
ungrouped_sorted_movies = merged[merged['title'].isin(active_titles.index)]

In [58]:
separated_rating = ungrouped_sorted_movies.groupby(['gender','title'], as_index=False).agg({'rating':np.mean})

In [66]:
# movies with highest rating for male & female ?
separated_rating.sort_values(['gender','rating'],ascending=False).head(3)

     gender                                              title    rating
1676      M                              Godfather, The (1972)  4.583333
2175      M  Seven Samurai (The Magnificent Seven) (Shichin...  4.576628
2187      M                   Shawshank Redemption, The (1994)  4.560625

In [65]:
# movies with highest rating for male & female
separated_rating.sort_values(['gender','rating'],ascending=False).groupby('gender').head(3)

     gender                                              title    rating
1676      M                              Godfather, The (1972)  4.583333
2175      M  Seven Samurai (The Magnificent Seven) (Shichin...  4.576628
2187      M                   Shawshank Redemption, The (1994)  4.560625
233       F                              Close Shave, A (1995)  4.644444
1203      F                         Wrong Trousers, The (1993)  4.588235
1064      F      Sunset Blvd. (a.k.a. Sunset Boulevard) (1950)  4.572650

In [70]:
pivoted_ratings = separated_rating.pivot('title', 'gender')

In [75]:
# female rating.mean() - men rating.mean()
# more negative = low rated by woman, highly rated by men
# more positive = highly rated by woman, lowly rated by women 

pivoted_ratings['rating'].apply(lambda x: x['F'] - x['M'], axis=1).sort_values()

title
Good, The Bad and The Ugly, The (1966)        -0.726351
Kentucky Fried Movie, The (1977)              -0.676359
Dumb & Dumber (1994)                          -0.638608
Longest Day, The (1962)                       -0.619682
Cable Guy, The (1996)                         -0.613787
Evil Dead II (Dead By Dawn) (1987)            -0.611985
Hidden, The (1987)                            -0.607167
Rocky III (1982)                              -0.581801
Caddyshack (1980)                             -0.573602
For a Few Dollars More (1965)                 -0.544704
Porky's (1981)                                -0.539489
Animal House (1978)                           -0.538286
Exorcist, The (1973)                          -0.529605
Fright Night (1985)                           -0.526316
Barb Wire (1996)                              -0.515020
Rocky II (1979)                               -0.501515
Beavis and Butt-head Do America (1996)        -0.498054
Big Trouble in Little China (1986)            -0.497078
From Dusk Till Dawn (1996)                    -0.496844
Wild Bunch, The (1969)                        -0.491736
Akira (1988)                                  -0.469233
Me, Myself and Irene (2000)                   -0.467537
Kingpin (1996)                                -0.465173
Where Eagles Dare (1969)                      -0.448718
Reservoir Dogs (1992)                         -0.444642
Raging Bull (1980)                            -0.431508
Godzilla (Gojira) (1954)                      -0.425328
South Park: Bigger, Longer and Uncut (1999)   -0.424206
Eyes Wide Shut (1999)                         -0.414736
Tommy Boy (1995)                              -0.414634
                                                 ...
Parent Trap, The (1961)                        0.412222
Sense and Sensibility (1995)                   0.414056
Beverly Hills Cop III (1994)                   0.422051
Hope Floats (1998)                             0.423802
Iron Eagle (1986)                              0.424817
Corrina, Corrina (1994)                        0.430897
Skulls, The (2000)                             0.432188
Sommersby (1993)                               0.435603
Gone with the Wind (1939)                      0.440471
South Pacific (1958)                           0.442764
Jewel of the Nile, The (1985)                  0.446157
Casper (1995)                                  0.446695
Never Been Kissed (1999)                       0.449636
Sound of Music, The (1965)                     0.450259
Grease 2 (1982)                                0.450925
Patch Adams (1998)                             0.464536
Mary Poppins (1964)                            0.467147
Guys and Dolls (1955)                          0.468391
Little Shop of Horrors, The (1960)             0.470312
French Kiss (1995)                             0.478752
Free Willy (1993)                              0.482573
Age of Innocence, The (1993)                   0.487561
Color Purple, The (1985)                       0.498851
Rocky Horror Picture Show, The (1975)          0.512885
Anastasia (1997)                               0.518391
Steel Magnolias (1989)                         0.535777
Little Women (1994)                            0.548849
Grease (1978)                                  0.608224
Jumpin' Jack Flash (1986)                      0.676359
Dirty Dancing (1987)                           0.830782
Length: 1216, dtype: float64

In [78]:
# highest std
ratings_std = ungrouped_sorted_movies.groupby('title')['rating'].std()

In [79]:
ratings_std.nlargest(5)

title
Dumb & Dumber (1994)                     1.321333
Blair Witch Project, The (1999)          1.316368
Natural Born Killers (1994)              1.307198
Tank Girl (1995)                         1.277695
Rocky Horror Picture Show, The (1975)    1.260177
Name: rating, dtype: float64